##  Terraform Plan — DEV Environment
 | Step | Result |
 |------|--------|
 | Format | `success` |
 | Validate | `success` |
 | Plan | `success` |

 <details><summary>Show Plan Output</summary>

 ```
 module.vpc.data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.bastion.data.aws_ami.ubuntu: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07059cc75f11713d1]
module.eks.aws_cloudwatch_log_group.eks_cluster_logs: Refreshing state... [id=/aws/eks/mlops-infr-dev-eks/cluster]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.ecr.aws_ecr_repository.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.ecr.aws_ecr_repository.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.eks.aws_iam_role.worker_nodes_role: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 1s [id=3552664922]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=mlops-infr-dev-eks-cluster-role]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]
module.ecr.aws_ecr_lifecycle_policy.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.ecr.aws_ecr_lifecycle_policy.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.bastion.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-0cb7a4f191bebf724]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-01b2c838b57531f93]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-007cd0e7b29778359]
module.bastion.aws_security_group.allow_ssh: Refreshing state... [id=sg-018bcb5ee8c15021d]
module.vpc.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0bd9ab14a25a2ef74]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-004d8cecea8a0c4f1]
module.security_group.aws_security_group.eks_worker_nodes: Refreshing state... [id=sg-001970adf59ac28ce]
module.security_group.aws_security_group.eks_control_plane: Refreshing state... [id=sg-0c66b7b4f00e84f45]
module.vpc.aws_eip.eip_nat["0"]: Refreshing state... [id=eipalloc-00e24240b0b221db1]
module.vpc.aws_eip.eip_nat["1"]: Refreshing state... [id=eipalloc-0acdb0803e2c20cb2]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-0f37fbe65a7746ebf]
module.security_group.aws_security_group_rule.nodes_to_control_plane_https: Refreshing state... [id=sgrule-3081238461]
module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet: Refreshing state... [id=sgrule-3778497427]
module.security_group.aws_security_group_rule.control_plane_to_nodes_https: Refreshing state... [id=sgrule-2697878827]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-0d5d53694e6efaef9]
module.bastion.aws_instance.bastion_host["1"]: Refreshing state... [id=i-0e2694484d71a9f4c]
module.bastion.aws_instance.bastion_host["0"]: Refreshing state... [id=i-0118db015463aadcb]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-024ed9eea52521ec3]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0e1503265d982f1f8]
module.vpc.aws_nat_gateway.nat_gateway["0"]: Refreshing state... [id=nat-0e8a24509562bcc5a]
module.vpc.aws_nat_gateway.nat_gateway["1"]: Refreshing state... [id=nat-02802366e4ad4f686]
module.vpc.aws_route_table.private_route_table["1"]: Refreshing state... [id=rtb-0a1af0604153bf064]
module.vpc.aws_route_table.private_route_table["0"]: Refreshing state... [id=rtb-038e197e45fb79150]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0cb6881648fa5b7ef]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0c58cdb2472e7372e]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260314151945067700000002]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260314151945031500000001]
module.eks.aws_iam_role_policy_attachment.worker_nodes_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260314151945177500000005]
module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260314151945151800000004]
module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260314151945138200000003]
module.eks.aws_eks_cluster.main: Refreshing state... [id=mlops-infr-dev-eks]
module.eks.data.tls_certificate.eks: Reading...
module.eks.data.tls_certificate.eks: Read complete after 0s [id=e612b2443a55ee2c98467bff460cf41a1094cd46]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::255315173346:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/D88A7B0C345E07139A6D641783B9B3F9]
module.eks.aws_eks_node_group.main: Refreshing state... [id=mlops-infr-dev-eks:mlops-infr-dev-eks-node-group]
module.load_balancer_controller.data.aws_iam_policy_document.aws_load_balancer_controller_assume_role_policy: Reading...
module.load_balancer_controller.aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::255315173346:policy/mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.data.aws_iam_policy_document.aws_load_balancer_controller_assume_role_policy: Read complete after 0s [id=1979176909]
module.argocd.helm_release.argocd: Refreshing state... [id=argocd]
module.load_balancer_controller.aws_iam_role.aws_load_balancer_controller: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.aws_iam_role_policy_attachment.aws_load_balancer_controller_attach: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller-20260314153047147200000013]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ingress_nginx.helm_release.ingress_nginx will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 900
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                # Ingress Nginx Helm values
                # Routing flow: Dev → NLB (Layer 4) → Ingress Nginx (Layer 7) → Service → Pod
                
                controller:
                  # Number of replicas is injected from Terraform variables
                  replicaCount: 2
                
                  # Use DaemonSet style pod anti-affinity for better distribution across nodes
                  affinity:
                    podAntiAffinity:
                    # Soft rule, spread across nodes
                    # K8s will try its best to schedule Pods onto different Nodes. But if the Cluster runs out of available Nodes, it will still allow two Pods to share a Node rather than leaving the Pod in a Pending state.
                      preferredDuringSchedulingIgnoredDuringExecution:
                        - weight: 100
                          podAffinityTerm:
                            labelSelector:
                              matchExpressions:
                                - key: app.kubernetes.io/name
                                  operator: In
                                  values:
                                    - ingress-nginx
                            # This is the area to "avoid. 
                            # If Node X already has a Pod labeled ingress-nginx, then prioritize finding a Node with a different hostname to place this new Pod on."
                            topologyKey: kubernetes.io/hostname
                
                  service:
                    # type: LoadBalancer causes the AWS LB Controller to provision an NLB
                    type: LoadBalancer
                    annotations:
                      # Use the newer "external" NLB type (not the legacy CLB)
                      service.beta.kubernetes.io/aws-load-balancer-type: "external"
                
                      # IP target mode: NLB sends traffic directly to Pod IPs, bypassing NodePort.
                      # This avoids double NAT, reduces latency, and is the recommended mode for EKS.
                      service.beta.kubernetes.io/aws-load-balancer-nlb-target-type: "ip"
                
                      # internet-facing: NLB is provisioned in public subnets and gets a public DNS name.
                      # Change to "internal" if only internal VPC access is needed.
                      service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
                
                      # Cross-zone load balancing, ensures even distribution across AZs
                      service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
                
                  # Expose a /healthz endpoint for the NLB health check
                  healthCheckPath: /healthz
                
                  # Resource limits, tuned for t3.medium worker nodes
                  resources:
                    requests:
                      cpu: 100m
                      memory: 128Mi
                    limits:
                      cpu: 500m
                      memory: 512Mi
                
                  # Required for proper X-Forwarded-For header handling behind NLB
                  config:
                    #This determines whether Nginx will decode the PROXY protocol header (usually at Layer 4 - TCP).
                    use-proxy-protocol: "false"
                
                    #Allow Nginx to trust and use HTTP headers.
                    #When an HTTP packet passes through the Load Balancer, the client's original IP address is written to the X-Forwarded-For header.
                    use-forwarded-headers: "true" 
                
                    #Enable processing of the entire IP address string in the X-Forwarded-For list.
                    compute-full-forwarded-for: "true"
                
                    #The network address range (CIDR) is considered a Trusted Proxy.
                    proxy-real-ip-cidr: "0.0.0.0/0"
                
                #In Kubernetes Ingress, defaultBackend is a fallback service. If a client accesses a URL that haven't configured in Ingress, Nginx will redirect the client to this defaultBackend (usually displaying a simple 404 page).
                defaultBackend:
                  enabled: false
            EOT,
        ]
      + verify                     = false
      + version                    = "4.14.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_https will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_https" {
      + description              = "HTTPS from EKS control plane (webhook aggregation)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-001970adf59ac28ce"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0c66b7b4f00e84f45"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_kubelet" {
      + description              = "Kubelet API - from EKS control plane"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-001970adf59ac28ce"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0c66b7b4f00e84f45"
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.nodes_to_control_plane_https will be created
  + resource "aws_security_group_rule" "nodes_to_control_plane_https" {
      + description              = "Kubernetes API - HTTPS from worker nodes"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0c66b7b4f00e84f45"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-001970adf59ac28ce"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

 ```
 </details>

 ---
 > **To apply this plan**, trigger the [Terraform Apply](../actions/workflows/terraform-apply.yml) workflow and enter:
 > - Environment: `dev`
 > - Plan Commit SHA: `7e1dfbb2e0b305333a5f87078cd998bfec783db3`

 >*Commit: `7e1dfbb2e0b305333a5f87078cd998bfec783db3`*